// заданние 1
// let i = 0;
// while (i < 2) {
// 	console.log('Привет');
// 	i++;
// }

// задание 2
// let i = 1;
// while (i <= 5) {
// 	console.log(i);
// 	i++;
// }

// задание 3
// let i = 7;
// while (i <= 22) {
// 	console.log(i);
// 	i++;
// }

// задание 4
// let obj = {
// 	'Коля': '200',
// 	'Вася': '300',
// 	'Петя': '400'
// }
// for (let salary in obj) {
// 	console.log(`${salary} -- зарплата ${obj[salary]}`);
// }

// задание 5
// let n = 1000;
// let num = 0
// while (n >= 50) {
// 	n /= 2;
// 	num++;
// }
// console.log(`Итераций: ${num}, получилось число ${n}`);

// задание 6
// вариант 1
// let i = 0;
// let day = 7;
// while (i < 31) {
// 	i++;
// 	if (i % 7 == 0) {
// 		console.log(`Сегодня пятница, ${i}-е число. Необходимо подготовить отчет.`);
// 	}
// }

// вариант 2
let day = 7;
for (let i = 1; i <= 31; i++) {
	if (i % day == 0) {
		console.log(`Сегодня пятница, ${i}-е число. Необходимо подготовить отчет.`);
	}
}